Revit 2027 API
ExternalServices.BuiltInExternalServices.ModifyConnectionParametersService Property
 The external service to view and modify structural connection parameters.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ModifyConnectionParametersService { get; }
Public Shared ReadOnly Property ModifyConnectionParametersService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ModifyConnectionParametersService {
	ExternalServiceId^ get ();
}
static member ModifyConnectionParametersService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace